Repository: Prisha1801/hobit_worker
Catalog: lib/l10n/app_*.arb
Languages: hi, mr

# appTitle
source: Hobit Worker
hi: होबिट वर्कर
mr: होबिट वर्कर

source: Language Selection
hi: भाषा चयन
mr: भाषा निवड

# chooseLanguage
source: Choose your preferred language
hi: अपनी पसंदीदा भाषा चुनें
mr: आपली पसंतीची भाषा निवडा

source: Save
hi: सेव करें
mr: जतन करा

source: About Us
hi: हमारे बारे में
mr: आमच्याबद्दल

# aboutTagline
source: Trusted Home Service Partner
hi: विश्वसनीय होम सर्विस पार्टनर
mr: विश्वसनीय गृह सेवा भागीदार

# aboutDescription
source: Hobit Worker is a platform created to empower service professionals by connecting them with verified service requests in their nearby areas. Our goal is to provide flexible work opportunities, transparent earnings, and a secure working environment for all workers. This app helps workers manage jobs, track earnings, and grow their professional journey with ease.
hi: होबिट वर्कर एक ऐसा प्लेटफॉर्म है जो सेवा पेशेवरों को उनके नजदीकी क्षेत्रों में सत्यापित सेवा अनुरोधों से जोड़ता है। हमारा उद्देश्य लचीले काम के अवसर, पारदर्शी कमाई और सुरक्षित कार्य वातावरण प्रदान करना है। यह ऐप काम प्रबंधित करने, कमाई ट्रैक करने और पेशेवर विकास में मदद करता है।
mr: होबिट वर्कर हे एक व्यासपीठ आहे जे सेवा व्यावसायिकांना जवळील सत्यापित सेवा विनंत्यांशी जोडते. आमचे उद्दिष्ट लवचिक काम, पारदर्शक उत्पन्न आणि सुरक्षित कार्य वातावरण देणे आहे. हे अॅप कामे व्यवस्थापित करण्यास, उत्पन्न ट्रॅक करण्यास आणि व्यावसायिक वाढीस मदत करते.

source: Version
hi: संस्करण
mr: आवृत्ती

source: Company
hi: कंपनी
mr: कंपनी

source: Support Email
hi: सपोर्ट ईमेल
mr: सपोर्ट ईमेल

source: Website
hi: वेबसाइट
mr: वेबसाइट

# companyName
source: Hobit Pvt. Ltd.
hi: होबिट प्रा. लि.
mr: होबिट प्रा. लि.

# copyright
source: © 2026 Hobit. All rights reserved.
hi: © 2026 होबिट। सर्वाधिकार सुरक्षित।
mr: © 2026 होबिट. सर्व हक्क राखीव.

source: Help & Support
hi: सहायता और समर्थन
mr: मदत आणि समर्थन

# needHelpHeader
source: Need help? We’re here for you. Get quick support for your work.
hi: मदद चाहिए? हम आपके लिए यहाँ हैं। अपने काम के लिए त्वरित सहायता प्राप्त करें।
mr: मदत हवी आहे? आम्ही तुमच्यासाठी आहोत. तुमच्या कामासाठी त्वरित मदत मिळवा.

source: Quick Support
hi: त्वरित सहायता
mr: त्वरित मदत

source: Call Support
hi: सपोर्ट को कॉल करें
mr: सपोर्टला कॉल करा

# callSupportSubtitle
source: Talk to our support executive
hi: हमारे सपोर्ट अधिकारी से बात करें
mr: आमच्या सपोर्ट अधिकाऱ्याशी बोला

source: Email Support
hi: सपोर्ट को ईमेल करें
mr: सपोर्टला ईमेल करा

source: Profile
hi: प्रोफ़ाइल
mr: प्रोफाइल

# helloWelcome
source: Hello, Welcome Back
hi: नमस्ते, फिर से स्वागत है
mr: नमस्कार, पुन्हा स्वागत आहे

source: Jobs Completed
hi: पूरे किए गए कार्य
mr: पूर्ण केलेली कामे

source: Wallet
hi: वॉलेट
mr: वॉलेट

# personalInfo
source: Personal Information
hi: व्यक्तिगत जानकारी
mr: वैयक्तिक माहिती

# personalInfoSub
source: Name, contact, location
hi: नाम, संपर्क, स्थान
mr: नाव, संपर्क, स्थान

source: Add Bank
hi: बैंक जोड़ें
mr: बँक जोडा

# addBankSub
source: Add your bank account for payouts
hi: भुगतान के लिए बैंक खाता जोड़ें
mr: पैसे मिळवण्यासाठी बँक खाते जोडा

# earnings
source: Earnings & Payouts
hi: कमाई और भुगतान
mr: उत्पन्न आणि पेआउट

# earningsSub
source: View your earnings and payout history
hi: अपनी कमाई और भुगतान इतिहास देखें
mr: तुमचे उत्पन्न आणि पेआउट इतिहास पहा

# helpSupportSub
source: Get help or contact support
hi: मदद प्राप्त करें या सपोर्ट से संपर्क करें
mr: मदत मिळवा किंवा सपोर्टशी संपर्क करा

# languageSelectionSub
source: Choose your preferred language
hi: अपनी पसंदीदा भाषा चुनें
mr: आपली पसंतीची भाषा निवडा

# aboutUsSub
source: App info, terms & privacy
hi: ऐप जानकारी, नियम और गोपनीयता
mr: अ‍ॅप माहिती, अटी व गोपनीयता

source: Logout
hi: लॉगआउट
mr: लॉगआउट

# logoutSub
source: Sign out of your account
hi: अपने खाते से साइन आउट करें
mr: तुमच्या खात्यातून साइन आउट करा

# addBankTitle
source: Add Your Bank Details
hi: अपने बैंक विवरण जोड़ें
mr: आपले बँक तपशील जोडा

source: Account Holder Name
hi: खाता धारक का नाम
mr: खातेदाराचे नाव

# accountHolderHint
source: Account Holder Name
hi: खाता धारक का नाम
mr: खातेदाराचे नाव

source: Account Number
hi: खाता संख्या
mr: खाते क्रमांक

# accountNumberHint
source: Your Account Number
hi: आपका खाता नंबर
mr: तुमचा खाते क्रमांक

source: Bank Name
hi: बैंक का नाम
mr: बँकेचे नाव

# bankNameHint
source: Your Bank Name
hi: आपके बैंक का नाम
mr: तुमच्या बँकेचे नाव

source: IFSC Code
hi: आईएफएससी कोड
mr: IFSC कोड

# ifscCodeHint
source: Your Bank IFSC Code
hi: आपके बैंक का IFSC कोड
mr: तुमच्या बँकेचा IFSC कोड

# fillAllFields
source: Please fill all fields
hi: कृपया सभी फ़ील्ड भरें
mr: कृपया सर्व माहिती भरा

# bankUpdated
source: Bank details updated
hi: बैंक विवरण अपडेट हो गया
mr: बँक तपशील अद्ययावत झाले

source: Personal Information
hi: व्यक्तिगत जानकारी
mr: वैयक्तिक माहिती

source: Profile Photo
hi: प्रोफ़ाइल फोटो
mr: प्रोफाइल फोटो

source: Basic Information
hi: मूल जानकारी
mr: मूलभूत माहिती

source: Name
hi: नाम
mr: नाव

source: Email
hi: ईमेल
mr: ईमेल

source: Mobile
hi: मोबाइल
mr: मोबाईल

source: Categories
hi: श्रेणियाँ
mr: वर्ग

source: Services
hi: सेवाएँ
mr: सेवा

source: Availability Status
hi: उपलब्धता स्थिति
mr: उपलब्धता स्थिती

source: Available
hi: उपलब्ध
mr: उपलब्ध

source: Unavailable
hi: अनुपलब्ध
mr: अनुपलब्ध

source: City
hi: शहर
mr: शहर

source: Zone
hi: ज़ोन
mr: झोन

source: Area
hi: क्षेत्र
mr: भाग

# selectCityFirst
source: Please select city first
hi: कृपया पहले शहर चुनें
mr: कृपया आधी शहर निवडा

# selectZoneFirst
source: Please select zone first
hi: कृपया पहले ज़ोन चुनें
mr: कृपया आधी झोन निवडा

source: Worker Availability
hi: कार्य उपलब्धता
mr: कामाची उपलब्धता

source: Available Dates
hi: उपलब्ध तिथियाँ
mr: उपलब्ध तारखा

source: Available Time Slots
hi: उपलब्ध समय
mr: उपलब्ध वेळ

# noAvailability
source: No Availability Added
hi: कोई उपलब्धता नहीं जोड़ी गई
mr: कोणतीही उपलब्धता जोडलेली नाही

source: Select Available Dates
hi: उपलब्ध तिथियाँ चुनें
mr: उपलब्ध तारखा निवडा

source: No dates added
hi: कोई तिथि नहीं जोड़ी गई
mr: कोणतीही तारीख जोडलेली नाही

source: Add Date
hi: तिथि जोड़ें
mr: तारीख जोडा

# selectTimeSlots
source: Select time range
hi: समय चुनें
mr: वेळ निवडा

# noTimeSlots
source: No time slots added
hi: कोई समय स्लॉट नहीं जोड़ा गया
mr: कोणताही वेळ स्लॉट जोडलेला नाही

source: Add Time Slot
hi: समय स्लॉट जोड़ें
mr: वेळ स्लॉट जोडा

# kycDetails
source: KYC Verification Details
hi: केवाईसी सत्यापन विवरण
mr: केवायसी पडताळणी तपशील

source: Aadhaar Number
hi: आधार नंबर
mr: आधार क्रमांक

# policeId
source: Police Verification ID
hi: पुलिस सत्यापन आईडी
mr: पोलीस पडताळणी आयडी

source: Document uploaded
hi: दस्तावेज़ अपलोड हो चुका है
mr: दस्तऐवज अपलोड झाला आहे

source: Upload document
hi: दस्तावेज़ अपलोड करें
mr: दस्तऐवज अपलोड करा

# profileUpdated
source: Profile updated successfully
hi: प्रोफ़ाइल सफलतापूर्वक अपडेट हुई
mr: प्रोफाइल यशस्वीरित्या अपडेट झाले

# kycUploaded
source: KYC uploaded successfully
hi: केवाईसी सफलतापूर्वक अपलोड हुई
mr: केवायसी यशस्वीरित्या अपलोड झाले

# uploadAllDocs
source: Please upload all documents
hi: कृपया सभी दस्तावेज़ अपलोड करें
mr: कृपया सर्व दस्तऐवज अपलोड करा

source: Save changes
hi: परिवर्तन सहेजें
mr: बदल जतन करा

source: Done
hi: हो गया
mr: पूर्ण झाले

source: Enter Aadhaar Number
hi: आधार नंबर दर्ज करें
mr: आधार क्रमांक प्रविष्ट करा

# enterPoliceId
source: Enter ID
hi: आईडी दर्ज करें
mr: आयडी प्रविष्ट करा

# aadhaarFront
source: Aadhaar Card (Front)
hi: आधार कार्ड (सामने)
mr: आधार कार्ड (समोर)

# aadhaarBack
source: Aadhaar Card (Back)
hi: आधार कार्ड (पीछे)
mr: आधार कार्ड (मागील)

# policeFront
source: Police Verification (Front)
hi: पुलिस सत्यापन (सामने)
mr: पोलीस पडताळणी (समोर)

# policeBack
source: Police Verification (Back)
hi: पुलिस सत्यापन (पीछे)
mr: पोलीस पडताळणी (मागील)

source: My Earnings
hi: मेरी कमाई
mr: माझी कमाई

source: Wallet Balance
hi: वॉलेट बैलेंस
mr: वॉलेट शिल्लक

source: Withdraw Request
hi: निकासी अनुरोध
mr: पैसे काढण्याची विनंती

source: Withdraw History
hi: निकासी इतिहास
mr: पैसे काढण्याचा इतिहास

# noWithdrawHistory
source: No withdrawal history found
hi: कोई निकासी इतिहास नहीं मिला
mr: पैसे काढण्याचा इतिहास आढळला नाही

source: Amount
hi: राशि
mr: रक्कम

source: Request Note
hi: अनुरोध नोट
mr: विनंती नोट

source: Weekly payout
hi: साप्ताहिक भुगतान
mr: साप्ताहिक पेआउट

source: Submit Request
hi: अनुरोध सबमिट करें
mr: विनंती सबमिट करा

# enterAmount
source: Please enter amount
hi: कृपया राशि दर्ज करें
mr: कृपया रक्कम प्रविष्ट करा

source: Enter valid amount
hi: मान्य राशि दर्ज करें
mr: वैध रक्कम प्रविष्ट करा

# withdrawDefaultNote
source: Withdrawal request
hi: निकासी अनुरोध
mr: पैसे काढण्याची विनंती

source: Approved
hi: स्वीकृत
mr: मंजूर

source: Rejected
hi: अस्वीकृत
mr: नाकारले

source: Pending
hi: लंबित
mr: प्रलंबित

# logoutConfirmMessage
source: Are you sure you want to logout from your account?
hi: क्या आप वाकई अपने खाते से लॉगआउट करना चाहते हैं?
mr: तुम्हाला खात्यातून लॉगआउट करायचे आहे का?

source: Cancel
hi: रद्द करें
mr: रद्द करा

source: Bookings
hi: बुकिंग्स
mr: बुकिंग्स

source: All Requests
hi: सभी अनुरोध
mr: सर्व विनंत्या

source: Assigned
hi: असाइन किया गया
mr: नेमलेले

source: In Progress
hi: प्रगति में
mr: प्रगतीत

source: Completed
hi: पूर्ण
mr: पूर्ण झाले

source: Cancelled
hi: रद्द
mr: रद्द केले

source: No bookings found
hi: कोई बुकिंग नहीं मिली
mr: कोणतीही बुकिंग आढळली नाही

source: Service Requested
hi: सेवा अनुरोधित
mr: सेवा विनंती

source: Booking ID
hi: बुकिंग आईडी
mr: बुकिंग आयडी

source: Attendance
hi: उपस्थिति
mr: हजेरी

# workShift
source: Work shift : 09:00 AM to 06:00 PM
hi: कार्य समय : 09:00 AM से 06:00 PM
mr: कामाची वेळ : 09:00 AM ते 06:00 PM

# currentAssignJob
source: Current Assigned Job
hi: वर्तमान असाइन किया गया कार्य
mr: सध्याचे नेमलेले काम

# noAssignedJobToday
source: No assigned job for today
hi: आज के लिए कोई असाइन किया गया कार्य नहीं
mr: आजसाठी कोणतेही काम नाही

source: Date & Time
hi: तारीख और समय
mr: तारीख आणि वेळ

# startService
source: Start your Service
hi: सेवा शुरू करें
mr: सेवा सुरू करा

source: Resend OTP
hi: ओटीपी पुनः भेजें
mr: ओटीपी पुन्हा पाठवा

source: Verify OTP
hi: ओटीपी सत्यापित करें
mr: ओटीपी पडताळा

source: OTP Verification
hi: ओटीपी सत्यापन
mr: ओटीपी पडताळणी

# enterOtpMsg
source: Please enter the verification code
hi: कृपया सत्यापन कोड दर्ज करें
mr: कृपया पडताळणी कोड टाका

# dontReceiveCode
source: Don't receive the code?
hi: कोड प्राप्त नहीं हुआ?
mr: कोड मिळाला नाही?

source: Resend
hi: पुनः भेजें
mr: पुन्हा पाठवा

source: Enter valid OTP
hi: मान्य ओटीपी दर्ज करें
mr: वैध ओटीपी टाका

# invalidOtp
source: Please enter valid 6 digit OTP
hi: अमान्य ओटीपी
mr: अवैध ओटीपी

# onboardTitle1
source: We are here for you!
hi: हम आपके लिए यहाँ हैं!
mr: आम्ही तुमच्यासाठी येथे आहोत!

# onboardTitle2
source: All services at one tap
hi: सभी सेवाएं एक टैप में
mr: सर्व सेवा एका टॅपमध्ये

# onboardTitle3
source: Trusted professionals nearby
hi: आस-पास विश्वसनीय प्रोफेशनल्स
mr: जवळील विश्वासार्ह तज्ज्ञ

source: Get started
hi: शुरू करें
mr: सुरू करा

# allowLocationTitle
source: Allow location access?
hi: लोकेशन एक्सेस की अनुमति दें?
mr: स्थान प्रवेशास परवानगी द्यायची का?

# allowLocationDesc
source: We need your location to find nearby services.
hi: हमें आपके आसपास की सेवाएं खोजने के लिए आपकी लोकेशन की आवश्यकता है।
mr: आम्हाला तुमच्या जवळील सेवा शोधण्यासाठी तुमचे स्थान आवश्यक आहे.

# allowLocationButton
source: Allow location access
hi: लोकेशन एक्सेस की अनुमति दें
mr: स्थान प्रवेशास परवानगी द्या

source: Login
hi: लॉगिन
mr: लॉगिन

source: Phone Number
hi: फोन नंबर
mr: फोन नंबर

# enterPhone
source: Enter your number
hi: अपना नंबर दर्ज करें
mr: तुमचा नंबर टाका

# keepSignedIn
source: Keep me signed in
hi: मुझे लॉग इन रखें
mr: मला लॉग इन ठेव

source: Send OTP
hi: ओटीपी भेजें
mr: ओटीपी पाठवा

# dontHaveAccount
source: Don’t have an Account?
hi: खाता नहीं है?
mr: खाते नाही?

source: Sign up here
hi: यहाँ साइन अप करें
mr: इथे साइन अप करा

# invalidPhone
source: Please enter valid phone number
hi: कृपया सही फोन नंबर दर्ज करें
mr: कृपया योग्य फोन नंबर टाका

source: OTP Sent
hi: ओटीपी भेज दिया गया है
mr: ओटीपी पाठवण्यात आला आहे

source: Something went wrong
hi: कुछ गलत हो गया
mr: काहीतरी चूक झाली

source: Sign Up
hi: साइन अप
mr: साइन अप

# enterFullName
source: Enter your full name
hi: पूरा नाम दर्ज करें
mr: पूर्ण नाव टाका

source: Phone
hi: फोन
mr: फोन

source: Password
hi: पासवर्ड
mr: पासवर्ड

# minPassword
source: Minimum 6 characters
hi: कम से कम 6 अक्षर
mr: किमान 6 अक्षरे

source: Category
hi: श्रेणी
mr: श्रेणी

source: Select Categories
hi: श्रेणियाँ चुनें
mr: श्रेणी निवडा

source: Service
hi: सेवा
mr: सेवा

source: Select Services
hi: सेवाएँ चुनें
mr: सेवा निवडा

source: Availability
hi: उपलब्धता
mr: उपलब्धता

# referCode
source: Refer / Referral Code
hi: रेफरल कोड
mr: रेफरल कोड

# referHint
source: Enter referral code (optional)
hi: रेफरल कोड दर्ज करें (वैकल्पिक)
mr: रेफरल कोड टाका (ऐच्छिक)

source: Select city
hi: शहर चुनें
mr: शहर निवडा

source: Select zone
hi: ज़ोन चुनें
mr: झोन निवडा

source: Select area
hi: क्षेत्र चुनें
mr: भाग निवडा

# selectDates
source: Select available dates
hi: उपलब्ध तिथियाँ चुनें
mr: तारखा निवडा

# acceptTerms
source: Accept Terms & Conditions
hi: नियम व शर्तें स्वीकार करें
mr: अटी व शर्ती स्वीकारा

# haveAccount
source: Have an account?
hi: पहले से खाता है?
mr: खाते आहे?

# signupSuccess
source: Registration successful
hi: पंजीकरण सफल रहा
mr: नोंदणी यशस्वी

# errName
source: Please enter your name
hi: कृपया नाम दर्ज करें
mr: नाव टाका

# errEmail
source: Please enter your email
hi: कृपया ईमेल दर्ज करें
mr: ईमेल टाका

# errEmailValid
source: Please enter valid email
hi: मान्य ईमेल दर्ज करें
mr: योग्य ईमेल टाका

# errPhone
source: Please enter phone number
hi: कृपया फोन नंबर दर्ज करें
mr: फोन नंबर टाका

# errPhoneLen
source: Phone number must be 10 digits
hi: फोन नंबर 10 अंकों का होना चाहिए
mr: फोन नंबर 10 अंकी असावा

# errPassword
source: Please enter password
hi: कृपया पासवर्ड दर्ज करें
mr: पासवर्ड टाका

# errPasswordLen
source: Password must be at least 6 characters
hi: पासवर्ड कम से कम 6 अक्षर का होना चाहिए
mr: पासवर्ड किमान 6 अक्षरे

# errCategory
source: Please select at least one category
hi: कम से कम एक श्रेणी चुनें
mr: किमान एक श्रेणी निवडा

# errService
source: Please select at least one service
hi: कम से कम एक सेवा चुनें
mr: किमान एक सेवा निवडा

# errCity
source: Please select city
hi: शहर चुनें
mr: शहर निवडा

# errZone
source: Please select zone
hi: ज़ोन चुनें
mr: झोन निवडा

# errArea
source: Please select area
hi: क्षेत्र चुनें
mr: भाग निवडा

# errDates
source: Please select available dates
hi: उपलब्ध तिथियाँ चुनें
mr: तारखा निवडा

# errTimes
source: Please select available time slots
hi: समय चुनें
mr: वेळ निवडा

# errTerms
source: Please accept Terms & Conditions
hi: नियम व शर्तें स्वीकार करें
mr: अटी व शर्ती स्वीकारा
